<details><summary>Show OpenTofu Plan</summary>

```


Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # openstack_blockstorage_volume_v3.legacy_app6 has been deleted
  - resource "openstack_blockstorage_volume_v3" "legacy_app6" {
      - id                   = "0bdf4b46-49a4-4eb4-8966-7eb6d2fdec90" -> null
        name                 = "app-www"
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # openstack_blockstorage_volume_v3.legacy_app6 will be created
  + resource "openstack_blockstorage_volume_v3" "legacy_app6" {
      + attachment           = (known after apply)
      + availability_zone    = (known after apply)
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "app-www"
      + region               = (known after apply)
      + size                 = 5
      + volume_retype_policy = "never"
      + volume_type          = (known after apply)
    }

  # openstack_compute_instance_v2.testinstance11 will be created
  + resource "openstack_compute_instance_v2" "testinstance11" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = "41f0ea41-75ca-44a6-be66-bb56b2a90721"
      + flavor_name         = (known after apply)
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = "01b13195-260c-4c8f-8378-8f5aa5344ede"
      + image_name          = (known after apply)
      + name                = "accounts-test11"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "accounts-application",
          + "accounts-default",
        ]
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = "d8a16ddf-c01f-4f22-8b67-8ed18b4b1b45"
        }
    }

  # openstack_compute_instance_v2.testinstance12 will be created
  + resource "openstack_compute_instance_v2" "testinstance12" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = "41f0ea41-75ca-44a6-be66-bb56b2a90721"
      + flavor_name         = (known after apply)
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = "f10bb6a3-765b-48fa-9bb2-cc9b9b29d3ac"
      + image_name          = (known after apply)
      + name                = "accounts-test12"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "accounts-application",
          + "accounts-default",
        ]
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = "d8a16ddf-c01f-4f22-8b67-8ed18b4b1b45"
        }
    }

  # openstack_compute_volume_attach_v2.legacy_app6 must be replaced
-/+ resource "openstack_compute_volume_attach_v2" "legacy_app6" {
      ~ id          = "9d7288ae-ad02-40a6-8976-495d63c040a0/0bdf4b46-49a4-4eb4-8966-7eb6d2fdec90" -> (known after apply)
      ~ region      = "eqiad1-r" -> (known after apply)
      ~ volume_id   = "0bdf4b46-49a4-4eb4-8966-7eb6d2fdec90" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @stwalkerster, Action: `pull_request`*